Revit 2027 API
ExternalDataManagerDataItem.Resolution Property
 The width and height of a image data item if applicable.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Resolution { get; set; }
Public Property Resolution As String
	Get
	Set
public:
property String^ Resolution {
	String^ get ();
	void set (String^ value);
}
member Resolution : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace